# Install with: brew bundle --file=~/.Brewfile

# Specify directory where to install Homebrew apps
cask_args appdir: "/Applications"

# Taps
# tap "homebrew/aliases" # deprecated
tap "homebrew/autoupdate"
# tap "homebrew/bundle" # deprecated
# tap "homebrew/cask" #  No longer needed
# tap "homebrew/cask-fonts" # deprecated
# tap "homebrew/cask-versions" # deprecated
tap "homebrew/command-not-found"
# tap "homebrew/core" # No longer needed
# tap "homebrew/services" # deprecated
tap "buo/cask-upgrade"

# Configuration & Brew related
brew "mas"
brew "cask"

# Base dev utilities
brew "git"
brew "node"
brew "nvm"
brew "pnpm"
brew "yarn"
brew "wget"
brew "nano"
brew "thefuck"

# brew "localtunnel"

# Web browsers
cask "arc"
cask "google-chrome@dev"
# cask "google-chrome"
# cask "firefox"

# Communication apps
# cask "slack"
# cask "zoom"
# cask "whatsapp"
# cask "discord"
# cask "pop"
# cask "anydesk"

# Security and Password apps
cask "1password"

# VPN
# cask "tunnelbear"
# cask "windscribe"
# cask "openvpn-connect"
# cask "tailscale"

# Development apps
cask "visual-studio-code"
cask "cursor"
# cask "warp"
# cask "sourcetree"
# cask "insomnia"
cask "httpie"
# cask "mockoon"
# cask "ngrok"
# cask "cyberduck"

# Drive apps
# cask "synology-drive"

# Productivity apps
cask "raycast"
cask "rectangle"
cask "shottr"
cask "voiceink"
# cask "deepl"
# cask "raindropio"
# cask "notion"

# Media apps
# cask "handbrake"
# cask "imageoptim"

# Other apps
# cask "adobe-creative-cloud"
cask "vlc"
cask "mediamate"
# cask "iina"
# cask "macs-fan-control"
# cask "microsoft-excel"
# cask "microsoft-powerpoint"
# cask "microsoft-word"
# cask "calibre"
cask "spotify"
cask "monitorcontrol"
cask "the-unarchiver"
# mas "Spark", id: 1176895641
cask "readdle-spark"
mas "Amphetamine", id: 937984704

# Fonts
cask "font-inter"
cask "font-jetbrains-mono"

# Apps requiring password
cask "logi-options-plus"
# cask "google-drive"
# cask "teamviewer"
# cask "krisp"
